Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You would then set the drawing target to the surface rather than the display and draw the things you wish as well as perform any other manipulations.
zh_cn: 然后你可以设置绘图目标到表面上，而不是显示器，往里面绘制内容并进行一些调整。

source: You would then want to check the returned ds_map in the asynchronous Cloud Event to get the status and the returned string, if there is one, with something like the following code:
zh_cn: 你需要检查从异步 Cloud Event 返回的 ds_map来获得返回的 status 和具体字符串。 你可以通过如下代码来获得：:

source: You'll find GameMaker Studio 2 to be easy and intuitive to use and that, whatever your skill level, you will soon be making those games you've always dreamed of.
zh_cn: 你会发现，GameMaker Studio 2简单直观并于易于使用，不论你的技能等级，你将很快可以制作你梦寐以求的那些游戏。

source: You'll find that GameMaker Studio 2 is intuitive and simple to use, and even if you've never used any tools like this before you shouldn't have any problems getting started and making games after reading through this section.
zh_cn: 你会发现，GameMaker Studio 2是直观且易用的，即使你以前没有使用过类似的工具。读过这一章节之后，入门以及开始制作游戏应该不会有任何困难。

source: You'll find the IDE is also incredibly flexible, and it can be customised to your needs - should the default IDE setup not cover something you require - through the use of the Plugin system.
zh_cn: 你也将发现这个IDE拥有不可思议的灵话性，它可以根据你的需要进行定制 - 默认的IDE设置不覆盖你要求的东西 - 通过 插件系统的使用。

source: Your library is empty.
zh_cn: 你的存储库是空的。

source: Your licence does not have this module enabled
zh_cn: 你的许可证中没有这个模块。

source: Your licence is tied to a YoYo Account (YYA) and you are required to have made one to be able to use GameMaker Studio 2 .
zh_cn: 你的许可信息是和YoYo 账户 (YYA) 绑定的，并且你会被要求必须有一个才能使用GameMaker Studio 2。

source: Your license does not have this module enabled
zh_cn: 你的许可证中没有这个模块。

source: Your project will now be closed.
zh_cn: 你的项目现在将被关闭。

source: Your tile set preview will appear here when you select a sprite
zh_cn: 选择一个精灵后，图块集预览将出现在这里

source: Your tile set preview will appear here when you select a tile set
zh_cn: 当你选中了一个图块集，你可以在这里预览

source: Your {0} licence is due to expire in under {1} days\nRenew now for uninterrupted access to your product
zh_cn: 您的{0}许可证将在{1}天后过期\n请及时续订，以便不间断地访问您的产品

source: Your {0} licence is due to expire in under {1} weeks\nRenew now for uninterrupted access to your product
zh_cn: 您的{0}许可证将在{1}周内过期\n请及时续订，以便不间断地访问您的产品

source: Zoom In
zh_cn: 放大

source: Zoom In (${room_area_zoom_in})
zh_cn: 放大 (${room_area_zoom_in})

source: Zoom In (${zoom_in_workspace})
zh_cn: 放大 (${zoom_in_workspace})

source: Zoom In (CTRL +)
zh_cn: 放大 (CTRL +)

source: Zoom Out
zh_cn: 缩小

source: Zoom Out (${room_area_zoom_out})
zh_cn: 缩小 (${room_area_zoom_out})

source: Zoom Out (${zoom_out_workspace})
zh_cn: 缩小 (${zoom_out_workspace})

source: Zoom Out (CTRL -)
zh_cn: 缩小 (CTRL -)

source: Zoom Reset (${reset_workspace_zoom})
zh_cn: 复位 (${reset_workspace_zoom})

source: Zoom Reset (CTRL + Enter)
zh_cn: 复位 (CTRL + Enter)

source: Zoom in
zh_cn: 放大

source: Zoom in the canvas view
zh_cn: 放大画布视图

source: Zoom in the workspace
zh_cn: 放大工作区

source: Zoom into the workspace
zh_cn: 放大工作区

source: Zoom out
zh_cn: 缩小

source: Zoom out of the workspace
zh_cn: 缩小工作区

source: Zoom out the canvas view
zh_cn: 缩小画布视图

source: Zoom out the workspace
zh_cn: 缩小工作区

source: Zoom: {0}%
zh_cn: 缩放： {0}%

source: [expression1] : [expression2]; (for more information on if and ternary operators see here)
zh_cn: [表达式 1] : [表达式 2]; 格式 （有关 if 和三元运算符的更多信息，请参阅 这里）

source: \nChoosing 'no' will maintain the user defined depths but will have undefined results in game.
zh_cn: \n选择“否”将会维持用户定义的深度，但会在游戏中导致未定义的结果。

source: \nChoosing 'no' will maintain the user defined depths, but will have undefined results in game.
zh_cn: \n选择“否”将会维持用户定义的深度，但会在游戏中导致未定义的结果。

# Reduce source image or output border sizes
source: \nReduce source image or output border sizes
zh_cn: \n请减小原图像或输出边界的尺寸。

# Would you like to restart and check for updates?
source: \nWould you like to restart and check for updates?
zh_cn: \n是否要重新启动并检查更新？

# You are on v{0} New version is {1}
source: \nYou are on v{0}\nNew version is {1}
zh_cn: \n现在是 v{0}\n新版本是 {1}

source: \n\nWARNING: Save will only update the resources files that are currently held in memory, and therefore may not restore some deleted or edited files
zh_cn: \n\n警告：保存只会更新当前内存中的资源文件，因此可能不会恢复一些删除或编辑过的文件。

source: a = ((b == c) || d); //best
zh_cn: a = ((b == c) || d); //最好

source: a = (b == c || d); //better
zh_cn: a = (b == c || d); //这样更好

source: and more (too many glyphs)
zh_cn: 以及更多 (符号过多)

source: array[count] = "are "
zh_cn: array[count] = "are "; // 再赋值

source: array[count] = "you?"
zh_cn: array[count] = "you?"; // 用变量作为数组的下标位置，给数组赋值

source: assignment to multi-relational-equality expression - GML does not support multiple assignments in an expression
zh_cn: 赋值给多关系等式（multi-relational-equality）表达式 - GML不支持在一个表达式中进行多重赋值

source: click here
zh_cn: 点击这里

source: cloud_file_save
zh_cn: cloud_file_save 云端文件保存

source: cloud_string_save
zh_cn: cloud_string_save 云端字符串保存

source: cloud_synchronise
zh_cn: cloud_synchronise 云端同步

source: colour = $FFAA00;
zh_cn: colour = $FFAA00; // 十六进制经常用来还你颜色，具体颜色用在线工具查看，ps当然也可以

source: count -= 1;
zh_cn: count -= 1; // 位置减1

source: count = 3;
zh_cn: count = 3; // 先用变量定义数组的最大位置

source: d' Days 'h' Hours 'm' Minutes 's' Seconds'
zh_cn: d' 天 'h' 时 'm' 分 's' 秒'

source: data from cloud_string_save or cloud_file_save was successfully uploaded to the cloud
zh_cn: 来自 cloud_string_save 或 cloud_file_save的数据被成功的上传到云端。

source: debug
zh_cn: 调试

source: description
zh_cn: 描述

source: do <statement> until (<expression>)
zh_cn: do <语句> until (<表达式>)

source: draw_text(32, 32, array[3]); //draw an array value
zh_cn: draw_text(32, 32, array[3]); // 绘制数组的值

source: duplicate enum entry found
zh_cn: 枚举项重复

source: end .NET 3.5 sp1
zh_cn: 结束安装 .NET 3.5 sp1

source: end .NET 4.5.2
zh_cn: 结束安装 .NET 4.5.2

source: end VS2012 x64
zh_cn: 结束安装 VS2012 x64

source: end VS2012 x86
zh_cn: 结束安装 VS2012 x86

source: end VS2015 x64
zh_cn: 结束安装 VS2015 x64

source: end VS2015 x86
zh_cn: 结束安装 VS2015 x86

source: enemy[3, 0] = obj_Slime; //Object
zh_cn: enemy[3, 0] = obj_Slime; //物体

source: errors found in uninstall
zh_cn: 卸载发现错误

source: expected expression
zh_cn: 预期的表达式

source: explorer
zh_cn: 资源管理器

source: finder
zh_cn: 查找器

source: flag
zh_cn: 标识

source: flags = flags | 1;
zh_cn: flags = flags | 1;flags

source: for (var i = 0; i < 10; i++;) {do something...};
zh_cn: for (var i = 0; i < 10; i++;) {做些什么...};

source: full
zh_cn: 全屏

source: iOS Icons Require Updating
zh_cn: iOS图标需要更新

source: iPad Landscape
zh_cn: iPad 横向

source: iPad Portrait
zh_cn: iPad 纵向

source: iPad Retina Landscape
zh_cn: iPad Retina 横向

source: iPad Retina Portrait
zh_cn: iPad Retina 纵向

source: iPad Retina iOS 5/6 Landscape
zh_cn: iPad Retina iOS 5/6 横向

source: iPad Retina iOS 5/6 Portrait
zh_cn: iPad Retina iOS 5/6 纵向

source: iPad Retina iOS 7 Landscape
zh_cn: iPad Retina iOS 7 横向

source: iPad Retina iOS 7 Portrait
zh_cn: iPad Retina iOS 7 纵向

source: iPad iOS 5/6 Landscape
zh_cn: iPad iOS 5/6 横向

source: iPad iOS 5/6 Portrait
zh_cn: iPad iOS 5/6 纵向

source: iPad iOS 7 Landscape
zh_cn: iPad iOS 7 横向

source: iPad iOS 7 Portrait
zh_cn: iPad iOS 7 纵向

source: iPhone 5 Landscape
zh_cn: iPhone 5 横向

source: iPhone 5 Portrait
zh_cn: iPhone 5 纵向

source: iPhone 5/6 2x Portrait
zh_cn: iPhone 5/6 2x 纵向

source: iPhone 5/6 Portrait
zh_cn: iPhone 5/6 纵向

source: iPhone 5/6 Retina4 Portrait
zh_cn: iPhone 5/6 Retina4 纵向

source: iPhone 6 Landscape
zh_cn: iPhone 6 横向

source: iPhone 6 Portrait
zh_cn: iPhone 6 纵向

source: iPhone 6+ Landscape
zh_cn: iPhone 6+ 横向

source: iPhone 6+ Portrait
zh_cn: iPhone 6+ 纵向

source: iPhone 7 2x Portrait
zh_cn: iPhone 7 2x 纵向

source: iPhone 7 Retina4 Portrait
zh_cn: iPhone 7 Retina4 纵向

source: iPhone 8 HD 4.7 Portrait
zh_cn: iPhone 8 HD 4.7 纵向

source: iPhone 8 HD 5.5 Landscape
zh_cn: iPhone 8 HD 5.5 横向

source: iPhone 8 HD 5.5 Portrait
zh_cn: iPhone 8 HD 5.5 纵向

source: iPhone Landscape
zh_cn: iPhone 横向

source: iPhone Portrait
zh_cn: iPhone 纵向

source: iPhone Retina Landscape
zh_cn: iPhone Retina 横向

source: iPhone Retina Portrait
zh_cn: iPhone Retina 纵向

source: iPhone X Landscape
zh_cn: iPhone X 横向

source: iPhone X Portrait
zh_cn: iPhone X 纵向

source: iPhone or iPod Touch
zh_cn: iPhone 或 iPod Touch

source: if !is_real(argument0)
zh_cn: if !is_real(argument0) // 如果不是实数

source: if (<expression>) <statement>
zh_cn: if (<表达式>) <语句>

source: if (<expression>) <statement> else <statement>
zh_cn: if (<表达式>) <语句1> else <语句2>

source: if (<expression>)
zh_cn: if (<表达式>)

source: if (a != b) {do something...}
zh_cn: if (a != b) {做些什么...}

source: if (a < b) {do something...}
zh_cn: if (a < b) {做些什么...}

source: if (a == b && c == d) {do something...}// and
zh_cn: if (a == b && c == d) {do something...} // 与

source: if (a == b ^^ c == d) {do something...} // xor
zh_cn: if (a == b ^^ c == d) {do something...} // 异或

source: if (a == b || c ==d) {do something...}// or
zh_cn: if (a == b || c ==d) {do something...} // 或

source: if (array[9]) == 10 //Check an array value
zh_cn: if (array[9]) == 10 // 检测数组的值

source: if (y ^ $1f) > 0 {do something...};
zh_cn: if (y ^ $1f) > 0 {做些什么...}; //

source: if /Conditional Operator
zh_cn: if/条件运算符

source: if keyboard_check_pressed(vk_enter)
zh_cn: if keyboard_check_pressed(vk_enter) // 检测回车键

source: if the status is a negative number, something has gone wrong and the user is informed, otherwise the code will continue and retrieve the synchronised data and write it to a text file for later use.
zh_cn: 如果 status 是一个负数, 则告知用户这里出现了错误, 否则，代码将继续获取同步的数据并将它写入一个文本文件供以后使用。

source: if you aren't sure about this, then simply leave everything "as-is", although if you are adding music or MP3 format sounds you should probably change to the Compressed - Not Streamed format.
zh_cn: 如果您不确定这一点，那么只需选择为“按原样”即可，但如果您要添加音乐或 MP3 格式的声音，则应该更改为 压缩 - 非流式 格式。

source: in this way you can have an instance with no physical presence in the room, but which can react to the collision of another instance, like the player, and do something in turn, like open a door, or trigger some sort of action in another place in the room.
zh_cn: 以这种方式，您可以拥有一个在房间中没有物理存在的实例，但是可以对另一个实例（如播放器）的冲突做出反应，并依次执行某些操作，例如打开门，或在另一个实例中触发某种动作放在房间里

source: lives (deprecated)
zh_cn: lives （不提倡使用）

source: macOS Application Zip
zh_cn: macOS 应用程序 Zip

source: macOS Install Path
zh_cn: macOS 安装路径

source: macOS icon {0} written out as 32-bit
zh_cn: macOS 图标{0}写为32位

source: macro {0} already exists
zh_cn: 已存在宏常量{0}

source: malformed array reference {0}
zh_cn: 格式错误的数组引用{0}

source: malformed hexadecimal character escape sequence
zh_cn: 错误的十六进制字符转义序列

source: malformed id reference {0}
zh_cn: 错误的引用{0}

source: malformed reference {0}
zh_cn: 错误的引用{0}

source: malformed variable reference got {0}
zh_cn: 格式错误的变量引用获得{0}

source: missing variable name in globalvar
zh_cn: globalvar中缺少变量名

source: missing variable name in var
zh_cn: var中缺少变量名

source: nested function calls are not allowed
zh_cn: 函数不允许嵌套调用

source: next: Do Effect
zh_cn: 下一页：产生特效

source: next: Draw Instance Score
zh_cn: 上一页 绘制实例分数

source: next: Get Audio Length
zh_cn: 下一页：获取音频长度

source: next: Get Audio Pitch
zh_cn: 下一页：获取音频音调（Get Audio Pitch）

source: next: Get Audio Volume
zh_cn: 下一页：获取音频音量

source: next: Get Master Volume
zh_cn: 下一页：获取主音量

source: next: If Audio Is Paused
zh_cn: 下一页：如果音频被暂停

source: next: If Audio Is Playing
zh_cn: 下一页：如果音频正在播放

source: next: Pause All Audio
zh_cn: 下一页：暂停所有音频

source: next: Play Audio
zh_cn: 下一页：播放音频

source: next: Resume All Audio
zh_cn: 下一页：恢复所有音频的播放

source: next: Resume Audio
zh_cn: 上一页：恢复音频的播放

source: next: Set Audio Pitch
zh_cn: 下一页：设置音频音调

source: next: Set Audio Position
zh_cn: 下一页：设置音频位置

source: next: Set Audio Volume
zh_cn: 下一页：设置音频音量

source: next: Set Master Volume
zh_cn: 下一页：设置主音量

source: next: Stop Audio
zh_cn: 下一页：停止音频

source: no matching #region found for #endregion
zh_cn: 未找到匹配于 #endregion 的 #region

source: number of arguments expected {0} - {1} got {2}
zh_cn: 本应收到 {0} - {1} 个参数却得到了{2}个参数

source: number of arguments expected {0} got {1}
zh_cn: 本应收到{0}个参数却得到了{1}个参数

source: object -> instance layer, sprite -> asset layer, path -> path layer
zh_cn: 物体 -> 实例层，精灵 -> 精灵层，路径 -> 路径层

source: object -> instance layer, sprite -> asset or background layer, path -> path layer
zh_cn: 物体-> 实例层，精灵 -> 资产或背景图层，路径 -> 路径层

source: of
zh_cn: 的

source: or as this:
zh_cn: 或者这样：

source: or inherit from
zh_cn: 或继承自

source: pixels
zh_cn: 像素

source: relative position: ({0}px, {1}px) dimension: ({2}px, {3}px)
zh_cn: 相对位置： ({0}px, {1}px) 尺寸： ({2}px, {3}px)

source: repeat (<expression>) <statement>
zh_cn: repeat (<表达式>) <语句>

source: return <expression>
zh_cn: return <表达式>

source: runInstaller Begin
zh_cn: 开始运行安装程序

source: runUnInstaller Done
zh_cn: 卸载结束

source: score (deprecated)
zh_cn: score （不提倡使用）

source: single quotes no longer allowed for string
zh_cn: 单引号不再允许用于字符串

source: switch (<expression>)
zh_cn: switch (<表达式>)

source: synchronization must be enabled for this platform
zh_cn: 必须为此平台启用垂直同步

source: the following code example illustrates a typical use for this type of statement:
zh_cn: 下面的代码解释这种语句的典型用法：

source: till
zh_cn: 直到

source: to
zh_cn: 到

source: to avoid this, use the () to separate out the parts, like this:
zh_cn: 为避免这种情况，使用“()”括号隔开不同的部分，像这样：

source: total = array[0] + array[5]; //Add two array values together
zh_cn: total = array[0] + array[5]; // 两个数组中的值相加

source: try needs to have catch or finally clause
zh_cn: try语句需要具备catch或finally子句

source: tvOS persistent storage space is currently limited to 500k via NSUserDefaults.
zh_cn: tvOS持久存储空间目前通过NSUserDefaults限制为500k。

source: unclosed #region found at End of Script
zh_cn: 在脚本结束点发现未收束的 #region 区块

source: unexpected binary operator {0}
zh_cn: 不应出现二元运算符{0}

source: unexpected node {0}
zh_cn: 不应出现节点 {0}

source: unexpected syntax error
zh_cn: 不期望的语法错误

source: unexpected terminal operator {0}
zh_cn: 不应出现结束符{0}

source: unexpected ternary operator {0}
zh_cn: 不应出现三元运算符{0}

source: unexpected unary operator {0}
zh_cn: 不应出现一元运算符{0}

source: uninstall from GAC... this may take some time
zh_cn: 从GAC卸载...这可能需要一些时间

source: unnecessary expression {0} used as a statement
zh_cn: 用作语句的不必要的表达式{0}

source: unterminated regular expression literal
zh_cn: 未收束正则表达式字面值

source: unterminated string literal
zh_cn: 未收束字符串字面值

source: use of {0} is not allowed in GameMaker Studio 2 Trial
zh_cn: 在 GameMaker Studio 2 试用版中不能使用{0}

source: value
zh_cn: 值

source: vbm_fast
zh_cn: vbm_fastvbm_fast

source: vk_space or ord("W") for example.
zh_cn: vk_space 或形如 ord("W")。

source: while (<expression>) <statement>
zh_cn: while (<表达式>) <语句>

source: will give different results depending on the platform.
zh_cn: 根据平台不同可能会得出不同的结果。

source: x *= y;
zh_cn: x *= y; // x腥等鱼歪，等同于 x = x * y;

source: x = (x & $ffffffe0) + 32;
zh_cn: x = (x & $ffffffe0) + 32; // 括号中的运算会将变量偏移为32、64、128等2的倍数，详见 http://wiki.gamemake.org/index.php?doc-view-6

source: x = 23;
zh_cn: x = 23; // x 将勇敢的等于23，不是233

source: x = y << 2;
zh_cn: x = y << 2; // 比如y = 100; 二进制数是 “1100100”，左移两位是“110010000”，转成十进制是400。每左移一位多乘一次2。

source: y += 5;
zh_cn: y += 5; // 等同于 y = y + 5; 等同于将“ y ++”执行五次。

source: {0} ({1}, {2}) parent - {3}
zh_cn: {0} ({1}, {2}) 父对象 - {3}

source: {0} - Length should be greater than {1}
zh_cn: {0} - 长度应大于 {1}

source: {0} - Length should be less than {1}
zh_cn: {0} - 长度应小于 {1}

source: {0} - List should only contain objects of type {2}{1}
zh_cn: {0} - 列表只应包含类型 {2}{1} 的对象

source: {0} - Object should be of type {2}{1}
zh_cn: {0} - 对象应该是类型 {2}{1}

source: {0} - String length is invalid must be between {1} and {2} characters
zh_cn: {0} - 字符串长度无效，必须在 {1} 至 {2} 个字符之间

source: {0} - Value cannot be null
zh_cn: {0} - 值不能为空

source: {0} - Value must be within range {1} - {2}
zh_cn: {0} - 值必须在范围 {1} - {2} 之内

source: {0} / {1}s
zh_cn: {0} / {1} 秒

source: {0} Application
zh_cn: {0} 应用程序

source: {0} Collision Event With {1}
zh_cn: {0}与{1}的碰撞事件

source: {0} Creation Code
zh_cn: {0} 创建时代码

source: {0} Event: {1}
zh_cn: {0} 事件： {1}

source: {0} Export
zh_cn: {0} 导出

source: {0} Files
zh_cn: {0} 个文件

source: {0} Fragment Shader
zh_cn: {0} 片段着色器

source: {0} Functions
zh_cn: {0} 函数

source: {0} Installer
zh_cn: {0} 安装程序

source: {0} Key Event: {1}
zh_cn: {0} 键事件：{1}

source: {0} Key Pressed: {1}
zh_cn: {0} 键按下事件：{1}

source: {0} Key Released: {1}
zh_cn: {0} 键释放事件：{1}

source: {0} Layers
zh_cn: {0} 层

source: {0} Macros
zh_cn: {0} 宏

source: {0} Package
zh_cn: {0} 程序包

source: {0} Properties
zh_cn: {0} 属性

source: {0} Tiles
zh_cn: {0} 图块

source: {0} Vertex Shader
zh_cn: {0} 顶点着色器

source: {0} at line {1} : {2}
zh_cn: {0}位于第{1}行 : {2}

source: {0} at line {1}, {2} : {3}
zh_cn: {0} 位于第{1}行, {2} : {3}

# {0} at line {1}: {2}
source: {0} at line {1}: \t{2}
zh_cn: {0}位于第{1}行: \t{2}

source: {0} does not implement ICloneable
zh_cn: {0} 没有实现ICloneable接口

source: {0} in DnD™ action {1}
zh_cn: 在 DnD™ 动作{1}中的{0}

source: {0} instance {1}:
zh_cn: {0} 实例 {1}：

source: {0} of {1} frames
zh_cn: {0} / {1} 帧

source: {0} reviews
zh_cn: {0} 条评论

source: {0} x {1} pixels
zh_cn: {0} x {1} 像素

source: {0}'Access All Areas'{1}.
zh_cn: {0}'访问所有区域'{1}。

source: {0}, line {1}
zh_cn: {0}，第{1}行

source: {0}/{1} Col:{2} Ch:{3}
zh_cn: {0}/{1} 列:{2} 字符:{3}

source: {0}: Events
zh_cn: {0}: 事件

source: {0}: Fragment Shader
zh_cn: {0}: 片元着色器

source: {0}: Instance Creation Order
zh_cn: {0}: 实例创建顺序

source: {0}: Moment {1}
zh_cn: {0}: 时刻 {1}

source: {0}: Moments
zh_cn: {0}: 时刻

source: {0}: Vertex Shader
zh_cn: {0}: 顶点着色器

source: {0}:{1} - Creation Code
zh_cn: {0}:{1} - 创建时代码

source: {1} Layer Properties - {0}
zh_cn: {1} 层属性 - {0}

source: {1} Properties - {0}
zh_cn: {1} 的属性 - {0}

source: {4} selected items - area: ({0}, {1}) -> ({2}, {3})
zh_cn: {4} 选中的项目 - 区域： ({0}, {1}) -> ({2}, {3})

source: Bitwise_Operators
zh_cn: 位运算

source: Command_Line
zh_cn: 命令行

source: Errors
zh_cn: 错误

source: File_System
zh_cn: 文件系统

source: Importing_Non_Bitmap_Sprites
zh_cn: 导入非位图精灵

source: Release_Notes
zh_cn: 发布说明

source: Obsolete_Functions
zh_cn: 过时函数

source: Texture_Pages
zh_cn: 材质页

source: Using_Buffers
zh_cn: 使用缓冲区

source: Included_Files
zh_cn: 包含文件

source: Required_SDKs
zh_cn: 必须的SDK

source: Device_Manager
zh_cn: 设备管理器

source: Project_Image_Generator
zh_cn: 项目图片生成器

source: Sound_Mixer
zh_cn: 混音器

source: Source_Control
zh_cn: 源控制

source: Textures
zh_cn: 纹理

source: Game_Options
zh_cn: 游戏选项

source: Drag_And_Drop_Overview
zh_cn: DnD概述

source: Drag_And_Drop_Reference
zh_cn: DnD参考

source: GML_Overview
zh_cn: GML概述

source: Menus
zh_cn: 菜单

source: Installation
zh_cn: 安装

source: GML_Reference
zh_cn: GML参考

source: Cameras And Display
zh_cn: 相机和显示器

source: Controls
zh_cn: 控制器

source: Async_Events
zh_cn: 异步事件

source: Draw_Events
zh_cn: 绘制事件

source: Options_Android
zh_cn: 安卓选项

source: options_html5
zh_cn: html5选项

source: Options_iOS
zh_cn: iOS选项

source: Options_Linux
zh_cn: Linux选项

source: Options_Mac
zh_cn: Mac选项

source: Options_Windows
zh_cn: Windows选项

source: Options_WindowsUWP
zh_cn: WindowsUWP选项

source: Action_Scripts
zh_cn: 动作脚本

source: Applying_Actions
zh_cn: DnD 应用动作

source: Changing_DnD
zh_cn: DnD转换

source: Creating_Action_Block_Code
zh_cn: 创建动作块代码

source: Audio_Actions
zh_cn: 音频动作

source: Prefs_DragAndDrop
zh_cn: 拖拽操作预设

source: Buffer_Actions
zh_cn: 缓冲器动作

source: Prefs_ExtensionEditor
zh_cn: 扩展编辑器预设

source: Maths
zh_cn: 数学

source: Camera_Actions
zh_cn: 相机动作

source: Prefs_General
zh_cn: 基础功能预设

source: Collision_Actions
zh_cn: 碰撞动作

source: Matrices
zh_cn: 矩阵

source: Common_Actions
zh_cn: 普通动作

source: Prefs_ImageEditor
zh_cn: 图片编辑器预设

source: Prefs_Languages
zh_cn: 代码语言预设

source: Data_Structure_Actions
zh_cn: 数据结构动作

source: Prefs_Marketplace
zh_cn: 插件市场预设

source: Prefs_ObjectEditor
zh_cn: 物体编辑器预设

source: Drawing_Actions
zh_cn: 绘制动作

source: Prefs_Plugins
zh_cn: 插件预设

source: Prefs_ResourceTree
zh_cn: 资源树预设

source: File_Actions
zh_cn: 文件动作

source: Prefs_RoomEditor
zh_cn: 房间编辑器预设

source: Game_Actions
zh_cn: 游戏动作

source: Prefs_Runtime
zh_cn: 运行预设

source: Gamepad_Actions
zh_cn: 游戏手柄动作

source: Prefs_SplineEditor
zh_cn: Spline编辑器预设

source: Instance_Actions
zh_cn: 实例动作

source: Prefs_SpriteEditor
zh_cn: 精灵编辑器预设

source: Prefs_TextEditor
zh_cn: 文本编辑器预设

source: Instance_Variable_Actions
zh_cn: 实例变量动作

source: Prefs_TilesetEditor
zh_cn: 图块集编辑器预设

source: Loop_Actions
zh_cn: 循环动作

source: Mathematics_Actions
zh_cn: 数学动作

source: Prefs_Timelines
zh_cn: 时间线预设

source: Misc_Actions
zh_cn: 杂项动作

source: Mouse_And_Keyboard_Actions
zh_cn: 鼠标和键盘动作

source: Movement_Actions
zh_cn: 移动动作

source: Particle_Actions
zh_cn: 粒子动作

source: Path_Actions
zh_cn: 路径动作

source: Room_Actions
zh_cn: 房间动作

source: Switch_Actions
zh_cn: Switch动作

source: Tile_Actions
zh_cn: 图块动作

source: Timeline_Actions
zh_cn: 时间线动作

source: Type_Actions
zh_cn: 类型动作

source: Language_Features
zh_cn: 语言特性

source: Addressing_Variables
zh_cn: 访问变量

source: Evaluation_Order
zh_cn: 求值顺序

source: Data_Types
zh_cn: 数据类型

source: Built_In_Variables
zh_cn: 内置变量

source: Checking_Data_Types
zh_cn: 检测数据类型

source: Build_Menu
zh_cn: 构建菜单

source: Variable_Functions
zh_cn: 变量函数

source: Edit_Menu
zh_cn: 编辑菜单

source: File_Menu
zh_cn: 文件菜单

source: Compatibility_Functions
zh_cn: 兼容性函数

source: Asynchronous Functions
zh_cn: 异步函数

source: Help_Menu
zh_cn: 帮助菜单

source: Layouts_Menu
zh_cn: 布局菜单

source: Marketplace_Menu
zh_cn: 市场菜单

source: Tools_Menu
zh_cn: 工具菜单

source: Windows_Menu
zh_cn: 窗口菜单

source: //do something
zh_cn: // 做些什么

source: Device Input
zh_cn: 设备输入

source: GamePad Input
zh_cn: 游戏手柄输入

source: Keyboard Input
zh_cn: 键盘输入

source: Mouse Input
zh_cn: 鼠标输入

source: Virtual Keys
zh_cn: 虚拟按键

source: DS Grids
zh_cn: 网格数据

source: DS Lists
zh_cn: 列表数据

source: DS Maps
zh_cn: 映射数据

source: DS Priority Queues
zh_cn: 优先队列数据

source: DS Queues
zh_cn: 队列数据

source: DS Stacks
zh_cn: 堆栈数据

source: Forms
zh_cn: 形状

source: Lighting
zh_cn: 灯光

source: Primitives
zh_cn: 图元

source: Sprites_And_Tiles
zh_cn: 精灵和图块

source: get_audio_length
zh_cn: 获取音频长度

source: get_audio_pitch
zh_cn: 获取音调

source: get_audio_volume
zh_cn: 获取音量

source: get_master_volume
zh_cn: 获取主音量

source: if_audio_is_paused
zh_cn: 判断声音是否暂停

source: if_audio_is_playing
zh_cn: 判断声音是否正在播放

source: pause_all_audio
zh_cn: 暂停所有声音

source: pause_audio
zh_cn: 暂停声音

source: Binary Files
zh_cn: 二进制文件

source: play_audio
zh_cn: 播放音频

source: File System
zh_cn: 文件系统

source: resume_all_audio
zh_cn: 恢复所有暂停的声音

source: resume_audio
zh_cn: 恢复声音

source: set_audio_pitch
zh_cn: 设置音调

source: set_audio_position
zh_cn: 设置音频的播放位置

source: Ini Files
zh_cn: Ini文件

source: set_audio_volume
zh_cn: 设置音频的音量

source: set_master_volume
zh_cn: 设置主音量

source: stop_all_audio
zh_cn: 停止所有音频的播放

source: stop_audio
zh_cn: 停止音频的播放

source: Deactivating_Instances
zh_cn: 冻结实例

source: Instance_Functions
zh_cn: 实例函数

source: copy_buffer
zh_cn: 复制缓冲器

source: Instance_Variables
zh_cn: 实例变量

source: create_buffer
zh_cn: 创建缓冲器

source: delete_buffer
zh_cn: 删除缓冲器

source: get_buffer_position
zh_cn: 获取缓冲器位置

source: get_buffer_size
zh_cn: 获取缓冲器大小

source: if_buffer_exists
zh_cn: 判断缓冲器是否存在

source: if_end_of_buffer
zh_cn: 判断是否在缓冲器的结束位置

source: read_buffer
zh_cn: 读取缓冲器

source: seek_buffer
zh_cn: 搜寻缓冲器

source: write_buffer
zh_cn: 写入缓冲器

source: Real Valued functions
zh_cn: 实数函数

source: get_view_variable
zh_cn: 获取视频变量

source: set_view_variable
zh_cn: 设置视野变量

source: if_any_object_at
zh_cn: 指定位置是否存在物体

source: if_collision_shape
zh_cn: 是否与图形发生碰撞

source: Vector Functions
zh_cn: 矢量函数

source: if_object_at
zh_cn: 位置是否存在指定物体

source: apply_to
zh_cn: 应用于物体

source: assign_var
zh_cn: 指定值

source: else
zh_cn: 否则

source: execute_code
zh_cn: 运行代码

source: execute_script
zh_cn: 运行脚本

source: exit
zh_cn: 退出

source: get_global_var
zh_cn: 获取全局变量

source: Motion Planning
zh_cn: 运动设计

source: if_expression
zh_cn: 判断表达式的结果

source: if_undefined
zh_cn: 判断是否undefined
